; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v11)
             (pred_1 ?v4 ?v12)
             (pred_4 ?v9 ?v12)
             (pred_3 ?v10 ?v9 )
	     (pred_11 ?v9)
             (pred_8 ?v7)
             (pred_2 ?v4)
             (pred_7 ?v12)
             (pred_6 ?v9)
             (pred_5 ?v4)
             (pred_10 ?v9)
             (pred_12 ))



(:action op_5
:parameters (?v13 ?v3 ?v5 ?v8)
:precondition (and (pred_8 ?v13) (pred_8 ?v3) (pred_2 ?v5) (pred_7 ?v8)
          (pred_9 ?v13 ?v3) (pred_1 ?v5 ?v8)
                   (pred_4 ?v3 ?v8) (pred_11 ?v13) 
                   (pred_6 ?v3) (pred_5 ?v5))
:effect (and  (pred_10 ?v3) (not (pred_6 ?v3))))


(:action op_4
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_8 ?v6)
               (pred_11 ?v13) (pred_9 ?v13 ?v6) (pred_10 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v13))))

(:action op_3
:parameters (?v13 ?v5)
:precondition (and (pred_8 ?v13) (pred_2 ?v5) 
                  (pred_11 ?v13) (pred_3 ?v5 ?v13) (pred_12 ))
:effect (and (pred_5 ?v5)
   (not (pred_3 ?v5 ?v13)) (not (pred_12 ))))


(:action op_1
:parameters (?v13 ?v2 ?v1)
:precondition (and (pred_8 ?v13) (pred_2 ?v2) (pred_2 ?v1)
                  (pred_11 ?v13) (pred_5 ?v1) (pred_3 ?v2 ?v13))
:effect (and (pred_5 ?v2) (pred_3 ?v1 ?v13)
        (not (pred_5 ?v1)) (not (pred_3 ?v2 ?v13))))

(:action op_2
:parameters (?v13 ?v5)
:precondition (and (pred_8 ?v13) (pred_2 ?v5) 
                  (pred_11 ?v13) (pred_5 ?v5))
:effect (and (pred_12 ) (pred_3 ?v5 ?v13) (not (pred_5 ?v5)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_12 obj_31 obj_19 obj_03 obj_10 obj_06 obj_29 obj_04 obj_02 obj_08 obj_26 obj_23 obj_16 obj_25 obj_18 obj_14 obj_22 obj_09 obj_13 obj_17 obj_01 obj_05 obj_21 obj_07
    obj_24 obj_20 obj_11
    obj_28 obj_30 obj_27
    )

    (:init
       (pred_12)

       (pred_8 obj_15)
       (pred_8 obj_12)
       (pred_8 obj_31)
       (pred_8 obj_19)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_8 obj_06)
       (pred_8 obj_29)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_08)
       (pred_8 obj_26)
       (pred_8 obj_23)
       (pred_8 obj_16)
       (pred_8 obj_25)
       (pred_8 obj_18)
       (pred_8 obj_14)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_07)
       (pred_7 obj_24)
       (pred_7 obj_20)
       (pred_7 obj_11)
       (pred_2 obj_28)
       (pred_2 obj_30)
       (pred_2 obj_27)

       (pred_9 obj_15 obj_10)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_12 obj_31)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_31 obj_29)
       (pred_9 obj_31 obj_19)
       (pred_9 obj_31 obj_12)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_31)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_06 obj_29)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_29 obj_23)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_29 obj_31)
       (pred_9 obj_29 obj_06)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_02 obj_25)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_26 obj_14)
       (pred_9 obj_26 obj_23)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_23 obj_22)
       (pred_9 obj_23 obj_16)
       (pred_9 obj_23 obj_29)
       (pred_9 obj_23 obj_26)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_16 obj_25)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_23)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_02)
       (pred_9 obj_25 obj_16)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_14 obj_01)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_26)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_22 obj_05)
       (pred_9 obj_22 obj_09)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_22)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_18)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_05 obj_21)
       (pred_9 obj_05 obj_22)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_29)
       (pred_4  obj_03 obj_24)
       (pred_4  obj_17 obj_20)
       (pred_4  obj_29 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_31)
       (pred_10 obj_19)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_26)
       (pred_10 obj_23)
       (pred_10 obj_16)
       (pred_10 obj_25)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_21)
       (pred_10 obj_07)

       (pred_1  obj_28 obj_24)
       (pred_1  obj_30 obj_20)
       (pred_1  obj_27 obj_11)
       (pred_3 obj_28 obj_18)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_27 obj_06)
       (pred_11 obj_25)
    )

    (:goal (and
       (pred_3 obj_28 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_08)))
)
)

; plan
1. (op_4 obj_25 obj_13)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_13)
   goals met: 0 of 1
2. (op_4 obj_13 obj_09)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_4 obj_09 obj_22)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_22)
   goals met: 0 of 1
4. (op_4 obj_22 obj_14)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_18)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_28)
   deleted: (pred_3 obj_28 obj_18) (pred_12)
   added: (pred_5 obj_28)
   goals met: 0 of 1
7. (op_4 obj_18 obj_14)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_14)
   goals met: 0 of 1
8. (op_4 obj_14 obj_26)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_26)
   goals met: 0 of 1
9. (op_4 obj_26 obj_06)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_06)
   goals met: 0 of 1
10. (op_4 obj_06 obj_12)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_12)
   goals met: 0 of 1
11. (op_2 obj_12 obj_28)
   deleted: (pred_5 obj_28)
   added: (pred_12) (pred_3 obj_28 obj_12)
   goals met: 1 of 1
